tests/aws_k6_results_combined.txt
ubuntu@ip-172-31-46-96:~$ k6 run performance-test.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: performance-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 150 looping VUs for 5m0s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ THRESHOLDS

    http_req_duration
    ✓ 'p(95)<800' p(95)=550.96ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    svc_a_fast_latency
    ✓ 'p(95)<100' p(95)=0

    svc_c_data_latency
    ✓ 'p(95)<100' p(95)=45.480621


  █ TOTAL RESULTS

    checks_total.......................: 233409  777.309931/s
    checks_succeeded...................: 100.00% 233409 out of 233409
    checks_failed......................: 0.00%   0 out of 233409

    ✓ status is 200

    CUSTOM
    svc_a_fast_latency......................................................: avg=0          min=0          med=0          max=0          p(90)=0          p(95)=0
    svc_a_slow_latency......................................................: avg=204.85857  min=11.041559  med=83.670096  max=735.74391  p(90)=566.401783 p(95)=589.974665
    svc_b_slow_latency......................................................: avg=246.614818 min=201.318656 med=238.444227 max=458.061116 p(90)=298.999057 p(95)=309.75514
    svc_c_data_latency......................................................: avg=17.869662  min=0.589468   med=14.399767  max=164.74967  p(90)=39.285714  p(95)=45.480621

    HTTP
    http_req_duration.......................................................: avg=115.54ms   min=589.46µs   med=32.1ms     max=735.74ms   p(90)=506.01ms   p(95)=550.96ms
      { expected_response:true }............................................: avg=115.54ms   min=589.46µs   med=32.1ms     max=735.74ms   p(90)=506.01ms   p(95)=550.96ms
    http_req_failed.........................................................: 0.00%  0 out of 233409
    http_reqs...............................................................: 233409 777.309931/s

    EXECUTION
    iteration_duration......................................................: avg=115.72ms   min=679.91µs   med=32.25ms    max=735.84ms   p(90)=506.2ms    p(95)=551.16ms
    iterations..............................................................: 233409 777.309931/s
    vus.....................................................................: 2      min=2           max=150
    vus_max.................................................................: 150    min=150         max=150

    NETWORK
    data_received...........................................................: 76 MB  254 kB/s
    data_sent...............................................................: 23 MB  77 kB/s



running (5m00.3s), 000/150 VUs, 233409 complete and 0 interrupted iterations
default ✓ [======================================] 000/150 VUs  5m0s
ubuntu@ip-172-31-46-96:~$