tests/k6_results_combined_optimized.txt

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: performance-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 150 looping VUs for 5m0s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ THRESHOLDS

    http_req_duration
    ✓ 'p(95)<800' p(95)=506.19ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    svc_a_fast_latency
    ✓ 'p(95)<100' p(95)=0

    svc_c_data_latency
    ✓ 'p(95)<100' p(95)=8.06404


  █ TOTAL RESULTS

    checks_total.......................: 307200  1023.619038/s
    checks_succeeded...................: 100.00% 307200 out of 307200
    checks_failed......................: 0.00%   0 out of 307200

    ✓ status is 200

    CUSTOM
    svc_a_fast_latency......................................................: avg=0          min=0        med=0         max=0        p(90)=0         p(95)=0
    svc_a_slow_latency......................................................: avg=163.879293 min=5.1811   med=17.6704   max=599.6405 p(90)=507.31075 p(95)=510.693925
    svc_b_slow_latency......................................................: avg=206.883944 min=198.6298 med=205.25045 max=349.99   p(90)=213.0392  p(95)=216.54198
    svc_c_data_latency......................................................: avg=3.072775   min=0        med=2.1829    max=143.6906 p(90)=6.16215   p(95)=8.06404

    HTTP
    http_req_duration.......................................................: avg=87.73ms    min=0s       med=11.67ms   max=599.64ms p(90)=502.85ms  p(95)=506.19ms
      { expected_response:true }............................................: avg=87.73ms    min=0s       med=11.67ms   max=599.64ms p(90)=502.85ms  p(95)=506.19ms
    http_req_failed.........................................................: 0.00%  0 out of 307200
    http_reqs...............................................................: 307200 1023.619038/s

    EXECUTION
    iteration_duration......................................................: avg=87.93ms    min=0s       med=11.81ms   max=599.64ms p(90)=502.98ms  p(95)=506.4ms
    iterations..............................................................: 307200 1023.619038/s
    vus.....................................................................: 2      min=2           max=150
    vus_max.................................................................: 150    min=150         max=150

    NETWORK
    data_received...........................................................: 100 MB 334 kB/s
    data_sent...............................................................: 30 MB  99 kB/s



running (5m00.1s), 000/150 VUs, 307200 complete and 0 interrupted iterations
default ✓ [======================================] 000/150 VUs  5m0s